app/Services/BasicService.php

    public function preparePaymentUpgradation($deposit)
    {


        try {
            if ($deposit->depositable_type == Deposit::class) {

                if ($deposit->status == 0 || $deposit->status == 2) {

                    $deposit->status = 1;
                    $deposit->save();

                    if ($deposit->user) {
                        $user = $deposit->user;
                        $user->balance += $deposit->payable_amount_in_base_currency;
                        $user->save();
---
update `deposits` set `status` = 1, `deposits`.`updated_at` = '2024-09-28 16:29:49' where `id` = 4
update `users` set `balance` = 501001, `users`.`updated_at` = '2024-09-28 16:29:49' where `id` = 3

    public function makeProjectInvest($user, $project, $amount, $unit)
    {
        $invest = new ProjectInvestment();
        $invest->user_id = $user->id;
        $invest->project_id = $project->id;
        $invest->per_unit_price = $amount;
        $invest->unit = $unit;
        $invest->return = $project->getProfit($unit, $amount);
        if ($project->number_of_return_has_unlimited) {
            $invest->is_life_time = true;
        } else {
            $invest->number_of_return = $project->number_of_return;
        }
        $invest->return_period = $project->return_period;
        $invest->return_period_type =  $project->return_period_type;
        $invest->next_return = $project->maturity();
        $invest->capital_back = $project->capital_back;
        $invest->project_expiry_date = $project->projectExpiry() ?? null;
        $invest->status = 1;
        if (!$project->projectExpiry()) {
            $invest->project_period_is_lifetime = true;
        }
        $invest->payment_status = 0;
        $invest->save();
---
insert into `project_investments` (`user_id`, `project_id`, `per_unit_price`, `unit`, `return`, `number_of_return`, `return_period`, `return_period_type`, `next_return`, `capital_back`, `project_expiry_date`, `status`, `payment_status`, `trx`, `updated_at`, `created_at`) values (3, 1, '18999', '1', 0, 0, 0, 'Hour', '2025-03-07 16:41:28', 0, '2024-11-28 16:41:28', 1, 0, 'PRI8091410681', '2024-09-28 16:41:28', '2024-09-28 16:41:28')

    public  function makeTransaction($user, $amount, $charge, $trx_type = null, $trx_id = null, $remarks = null, $transactional_type = null, $walletType = null)
    {
        $walletType = strtolower($walletType);
        $transaction = new Transaction();
        $transaction->user_id = $user->id;
        $transaction->amount = $amount;
        $transaction->charge = $charge;
        $transaction->trx_type = $trx_type;
        if ($trx_id != null) {
            $transaction->trx_id = $trx_id;
        }
        $transaction->remarks = $remarks;
        $transaction->transactional_type = $transactional_type;
        $transaction->wallet_type = $walletType;
        if ($walletType && $walletType === 'profit') {
            $transaction->balance =  $user->profit_balance;
        } else {
            $transaction->balance =  $user->balance;
        }
        $transaction->save();
---
insert into `transactions` (`user_id`, `amount`, `charge`, `trx_type`, `trx_id`, `remarks`, `transactional_type`, `wallet_type`, `balance`, `updated_at`, `created_at`) values (3, 18999, 0, '-', 'PRI8091410681', 'Investment from Wallet', 'App\Models\Project', 'wallet', '406006', '2024-09-28 16:41:28', '2024-09-28 16:41:28')