app/Http/Controllers/User/HomeController.php

select sum(`payable_amount_in_base_currency`) as aggregate from `deposits` where `user_id` = 1 and `depositable_type` = 'App\Models\Deposit' and `status` = 1
select sum(`amount_in_base_currency`) as aggregate from `payouts` where `user_id` = 1 and `status` = 2
select `amount_in_base_currency` from `payouts` where `user_id` = 1 and `status` = 2 order by `created_at` desc limit 1
select * from `invest_histories` where `user_id` = 1 order by `created_at` desc, `created_at` desc limit 2
select * from `support_tickets` where `user_id` = 1
select * from `users` where `users`.`id` in (1) and `users`.`deleted_at` is null
select * from `project_investments` where `user_id` = 1 and `payment_status` = 1 order by `created_at` desc, `created_at` desc limit 2
select * from `projects` where `projects`.`id` in (1)
select count(`id`) as aggregate from `support_tickets` where `user_id` = 1 and `created_at` >= '2024-09-21 16:48:23'
select sum(`amount_in_base_currency`) as aggregate from `payouts` where `user_id` = 1 and `status` = 2 and `created_at` >= '2024-09-21 16:48:23'
select sum(`invest_amount`) as aggregate from `invest_histories` where `user_id` = 1 and `created_at` >= '2024-09-21 16:48:23'
select SUM(per_unit_price * unit) as total_investment from `project_investments` where `user_id` = 1 and `payment_status` = 1 and `created_at` >= '2024-09-21 16:48:23' limit 1
select * from `referral` where `commission_type` = 'reward_system'
---
    public function index()
    {
        $data['user'] = Auth::user();
        $data['firebaseNotify'] = config('firebase');
        $data['total_deposit'] =  Deposit::where('user_id', Auth::id())->where('depositable_type', Deposit::class)->where('status', 1)->sum('payable_amount_in_base_currency');
        $data['total_withdraw'] = Payout::where('user_id', Auth::id())->where('status', 2)->sum('amount_in_base_currency');
        $data['last_withdraw'] = Payout::where('user_id', Auth::id())->where('status', 2)->select('amount_in_base_currency')->orderBy('created_at', 'desc')->first();
        $data['recent_plan'] = InvestHistory::with('plan')->where('user_id', Auth::id())->latest()->take(2)
            ->orderByDesc('created_at')->get();
        $tickets = SupportTicket::with('user') // Eager load related models
            ->where('user_id', Auth::id())
            ->get();
        $data['pending_ticket'] = count($tickets->where('status', 0));
        $data['answered_ticket'] = count($tickets->where('status', 1));
        $data['closed_ticket'] = count($tickets->where('status', 3));
        $data['recent_project'] =  ProjectInvestment::with('project.details')->where('user_id', Auth::id())
            ->where('payment_status', 1)
            ->orderBy('created_at', 'DESC')->latest()->take(2)->get();

        $sevenDaysAgo = Carbon::now()->subDays(7);

        $data['recentTickets'] = SupportTicket::with('user') // Eager load related models
            ->where('user_id', Auth::id())->where('created_at', '>=', $sevenDaysAgo)->count('id');
        $data['recent_withdraw'] = Payout::where('user_id', Auth::id())->where('status', 2)
            ->where('created_at', '>=', $sevenDaysAgo)->sum('amount_in_base_currency');
        $data['recent_plan_invest'] = InvestHistory::with('plan')->where('user_id', Auth::id())
            ->where('created_at', '>=', $sevenDaysAgo)
            ->sum('invest_amount');


        $data['recent_project_invest'] = ProjectInvestment::where('user_id', Auth::id())
            ->where('payment_status', 1)
            ->where('created_at', '>=', $sevenDaysAgo)
            ->select(DB::raw('SUM(per_unit_price * unit) as total_investment'))
            ->first()->total_investment;

        $data['reward_system'] = Referral::where('commission_type', 'reward_system')->get();

select * from `gateways` where `status` = 1 order by `sort_by` asc
---
    public function addFund()
    {
        $data['basic'] = basicControl();
        $data['gateways'] = Gateway::where('status', 1)->orderBy('sort_by', 'ASC')->get();

select MONTH(created_at) as month, YEAR(created_at) as year, SUM(invest_amount) as total from `invest_histories` where `user_id` = 3 group by `year`, `month`
select MONTH(created_at) as month, YEAR(created_at) as year, SUM(per_unit_price * unit) as total from `project_investments` where `user_id` = 3 and `payment_status` = 1 group by `year`, `month`
---
    public function investHistory()
    {
        $planInvest = InvestHistory::where('user_id', Auth::id())
            ->selectRaw('MONTH(created_at) as month, YEAR(created_at) as year, SUM(invest_amount) as total')
            ->groupBy('year', 'month')
            ->get();
        $projectInvest = ProjectInvestment::where('user_id', Auth::id())
            ->where('payment_status', 1)
            ->selectRaw('MONTH(created_at) as month, YEAR(created_at) as year, SUM(per_unit_price * unit) as total')
            ->groupBy('year', 'month')
            ->get();

select MONTH(created_at) as month, YEAR(created_at) as year, SUM(payable_amount_in_base_currency) as total from `deposits` where `user_id` = 3 and `status` = 1 and `depositable_type` = 'App\Models\Deposit' group by `month`, `year`
select MONTH(created_at) as month, YEAR(created_at) as year, SUM(amount_in_base_currency) as total from `payouts` where `user_id` = 3 and `status` = 2 group by `month`, `year`
---
    public function depositPayout()
    {
        $deposits = Deposit::where('user_id', Auth::id())
            ->where('status', 1)
            ->where('depositable_type', Deposit::class)
            ->selectRaw('MONTH(created_at) as month, YEAR(created_at) as year, SUM(payable_amount_in_base_currency) as total')
            ->groupBy('month', 'year')
            ->get();
        $payouts = Payout::where('user_id', Auth::id())
            ->where('status', 2)
            ->selectRaw('MONTH(created_at) as month, YEAR(created_at) as year, SUM(amount_in_base_currency) as total')
            ->groupBy('month', 'year')
            ->get();

select MONTH(created_at) as month, YEAR(created_at) as year, SUM(amount) as total from `referral_bonuses` where `from_user_id` = 1 group by `month`, `year`
---
    public function getReferralsBonus()
    {
        $referrals = ReferralBonus::where('from_user_id', Auth::id())
            ->selectRaw('MONTH(created_at) as month, YEAR(created_at) as year, SUM(amount) as total')
            ->groupBy('month', 'year')
            ->get();

select * from `transactions` where `user_id` = 1 order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `transactions` where `user_id` = 1
---
    public function transactions(Request $request)
    {
        $dateRange = str_replace('to', '', $request->date_range);
        $dateRange = preg_replace('/\s+/', ' ', $dateRange);
        $dateArray = array_map('trim', explode(' ', $dateRange));
        $fromDate = false;
        $toDate = false;
        if ($request->date_range) {
            $fromDate = $dateArray[0];
            $toDate = $dateArray[1];
        }

        $transactions = Transaction::where('user_id', Auth::id())
            ->when($request->trx_id, function ($query) use ($request) {
                $query->where('trx_id', $request->trx_id);
            })
            ->when($request->remark, function ($query) use ($request) {
                $query->where('remarks', 'LIKE', '%' . $request->remark . '%');
            })
            ->when($fromDate && $toDate, function ($query) use ($fromDate, $toDate) {
                $query->whereBetween('created_at', [$fromDate, $toDate]);
            })
            ->orderBy('created_at', 'desc')
            ->paginate(15);

select * from `project_investments` where `user_id` = 3 and `payment_status` = 1 order by `created_at` desc limit 12 offset 0
select * from `projects` where `projects`.`id` in (1)
select count(*) as aggregate from `project_investments` where `user_id` = 3 and `payment_status` = 1
---
    public function projectInvestment(Request $request)
    {
        $name = $request->name;
        $filterDate = explode('to', $request->date_range);
        $startDate = $filterDate[0];
        $endDate = isset($filterDate[1]) ? trim($filterDate[1]) : null;
        $projectInvestment = ProjectInvestment::with('project.details')->where('user_id', Auth::id())
            ->where('payment_status', 1)
            ->when(!empty($request->date_range) && $endDate == null, function ($query) use ($startDate) {
                $startDate = Carbon::parse(trim($startDate))->startOfDay();
                $query->whereDate('created_at', $startDate);
            })
            ->when(!empty($request->date_range) && $endDate != null, function ($query) use ($startDate, $endDate) {
                $startDate = Carbon::parse(trim($startDate))->startOfDay();
                $endDate = Carbon::parse(trim($endDate))->endOfDay();
                $query->whereBetween('created_at', [$startDate, $endDate]);
            })
            ->when(!empty($name), function ($query) use ($name) {
                return $query->whereHas('project.details', function ($query) use ($name) {
                    return $query->where('title', 'LIKE', '%' . $name . '%');
                });
            })
            ->orderBy('created_at', 'DESC')->paginate(12);

select MONTH(created_at) as month, YEAR(created_at) as year, SUM(amount) as total from `transactions` where `user_id` = 1 group by `month`, `year`
---
    public function transactionHistory()
    {
        $transactions = Transaction::where('user_id', Auth::id())
            ->selectRaw('MONTH(created_at) as month, YEAR(created_at) as year, SUM(amount) as total')
            ->groupBy('month', 'year')
            ->get();

select * from `referral_bonuses` where `from_user_id` = 1 order by `created_at` desc limit 15 offset 0
select `id`, `username`, `firstname`, `lastname`, `image`, `image_driver` from `users` where `users`.`id` in (1) and `users`.`deleted_at` is null
select count(*) as aggregate from `referral_bonuses` where `from_user_id` = 1
---
    public function referralBonus(Request $request)
    {

        $remark = $request->remark;

        $filterDate = explode('to', $request->date_range);
        $startDate = $filterDate[0];
        $endDate = isset($filterDate[1]) ? trim($filterDate[1]) : null;
        $commission_type = $request->type;


        $referrals = ReferralBonus::query()->with(['user:id,username,firstname,lastname,image,image_driver'])
            ->where('from_user_id', Auth::id())
            ->orderBy('created_at', 'desc')
            ->when(!empty($request->date_range) && $endDate == null, function ($query) use ($startDate) {
                $startDate = Carbon::parse(trim($startDate))->startOfDay();
                $query->whereDate('created_at', $startDate);
            })
            ->when(!empty($request->date_range) && $endDate != null, function ($query) use ($startDate, $endDate) {
                $startDate = Carbon::parse(trim($startDate))->startOfDay();
                $endDate = Carbon::parse(trim($endDate))->endOfDay();
                $query->whereBetween('created_at', [$startDate, $endDate]);
            })
            ->when(!empty($remark), function ($query) use ($remark) {
                return $query->where('remarks', $remark);
            })
            ->when(!empty($commission_type), function ($query) use ($commission_type) {
                return $query->where('commission_type', $commission_type);
            })
            ->paginate(15);