app/Http/Controllers/User/ProjectInvestController.php

select * from `projects` where (`status` = 1 and `id` = '1') limit 1
---
    public function invest(Request $request)
    {
        //validate request
        $validator = Validator::make($request->all(), [
            'balance_type' => ['required', Rule::in(['checkout', 'balance', 'profit'])],
            'amount' => 'required|numeric',
            'project_id' => 'required',
            'unit' => 'required | numeric'
        ], [
            'balance_type.required' => 'The balance type field is required.',
            'balance_type.in' => 'The selected balance type is invalid. It must be either checkout or balance.',
            'amount.required' => 'Unit price field is required.',
            'amount.numeric' => 'The amount must be a number.',
            'project_id.required' => 'The project ID field is required.',
            'unit.required' => 'The unit field is required.'
        ]);

        //if validation failed then return back with validation error message
        if ($validator->fails()) {
            return back()->with('error', $validator->getMessageBag()->first());
        }


        $balance_type = $request->balance_type;
        $user = Auth::guard('web')->user();

        try {

            $project = Project::with('details')
                ->where(['status' => 1, 'id' => $request->project_id])->firstOr(function () {
                    throw new \Exception('Invalid Project request');
                });

update `projects` set `available_units` = 1492, `projects`.`updated_at` = '2024-09-28 16:41:28' where `id` = 1
---
                $invest->payment_status = 1;
                $invest->save();
                $project->available_units -= $request->unit;
                $project->save();

update `users` set `balance` = '406006', `total_invest` = 113994, `project_invest` = 113994, `users`.`updated_at` = '2024-09-28 16:41:28' where `id` = 3
---
                $user->balance = getAmount($user->balance - ($request->amount * $request->unit));
                $user->project_invest += $amount;
                $user->total_invest += $amount;
                $user->save();

update `transactions` set `transactional_id` = 1, `transactions`.`updated_at` = '2024-09-28 16:41:28' where `id` = 23
---
                //make transaction
                $transactional_type = 'App\Models\Project';
                $transaction = BasicService::makeTransaction($user, ($request->amount * $request->unit), 0, '-', $invest->trx, 'Investment from Wallet', $transactional_type, 'wallet');
                $project->transactional()->save($transaction);