app/Traits/Notify.php

select * from `notification_permissions` where `notifyable_id` = 3 limit 1
select * from `notification_templates` where `template_key` = 'PROJECT_INVEST_USER' and `language_id` is null and `notify_for` = 0 limit 1
select * from `notification_templates` where `template_key` = 'PROJECT_INVEST_USER' and `notify_for` = 0 limit 1
---
    public function mail($user, $templateKey = null, $params = [], $subject = null, $requestMessage = null)
    {
        $notificationPermission = NotificationPermission::where('notifyable_id', $user->id)->first();

        try {

            if ($notificationPermission && $notificationPermission->template_email_key) {
                if (!in_array($templateKey, $notificationPermission->template_email_key)) {
                    return false;
                }
            }

            $basic = basicControl();
            $email_body = $basic->email_description;

            $templateObj = NotificationTemplate::where('template_key', $templateKey)->where('language_id', $user->language_id)->where('notify_for', 0)->first();
            if (!$templateObj) {
                $templateObj = NotificationTemplate::where('template_key', $templateKey)->where('notify_for', 0)->first();

select * from `notification_permissions` where `notifyable_id` = 3 limit 1
---
    public function userFirebasePushNotification($user, $templateKey, $params = [], $action = null)
    {


        try {
            $basic = basicControl();
            $notify = config('firebase');

            $notificationPermission = NotificationPermission::where('notifyable_id', $user->id)->first();

select * from `notification_permissions` where `notifyable_id` = 3 limit 1
select * from `notification_templates` where `template_key` = 'PROJECT_INVEST_USER' and `language_id` is null and `notify_for` = 0 limit 1
select * from `notification_templates` where `template_key` = 'PROJECT_INVEST_USER' and `notify_for` = 0 limit 1
---
    public function userPushNotification($user, $templateKey, $params = [], $action = [])
    {


        try {
            $basic = basicControl();

            if ($basic->in_app_notification != 1) {
                return false;
            }


            $notificationPermission = NotificationPermission::where('notifyable_id', $user->id)->first();


            if ($notificationPermission && !in_array($templateKey, $notificationPermission->template_in_app_key)) {
                return false;
            }


            $templateObj = NotificationTemplate::where('template_key', $templateKey)
                ->where('language_id', $user->language_id)->where('notify_for', 0)
                ->first();

            if (!$templateObj) {
                $templateObj = NotificationTemplate::where('template_key', $templateKey)->where('notify_for', 0)->first();

insert into `in_app_notifications` (`description`, `in_app_notificationable_id`, `in_app_notificationable_type`, `updated_at`, `created_at`) values ('{\"link\":\"http:\/\/127.0.0.1:8000\/user\/project\/investment\",\"icon\":\"fa-regular fa-circle-check text-success\",\"text\":\"You invested  18,999  INR  form Project My Startup Pack . Total Unit : 1 Per Unit Price : 18,999  INR \"}', 3, 'App\Models\User', '2024-09-28 16:41:29', '2024-09-28 16:41:29')
---

            $inAppNotification = new InAppNotification();
            $inAppNotification->description = $action;
            $user->inAppNotification()->save($inAppNotification);

select * from `notification_templates` where `template_key` = 'PROJECT_INVEST' and `notify_for` = 1 limit 1
select * from `fire_base_tokens` where `tokenable_type` = 'App\Models\Admin'
---
    public function adminFirebasePushNotification($templateKey, $params = [], $action = null)
    {
        try {
            $basic = basicControl();
            $notify = config('firebase');
            if (!$notify) {
                return false;
            }

            if (!$basic->push_notification) {
                return false;
            }

            $templateObj = NotificationTemplate::where('template_key', $templateKey)->where('notify_for', 1)->first();
            if (!$templateObj->status['push']) {
                return false;
            }

            if (!$templateObj) {
                return false;
            }

            $template = '';
            if ($templateObj) {
                $template = $templateObj->push;
                foreach ($params as $code => $value) {
                    $template = str_replace('[[' . $code . ']]', $value, $template);
                }
            }
            $admins = FireBaseToken::where('tokenable_type', Admin::class)->get();

select * from `notification_templates` where `template_key` = 'PROJECT_INVEST' and `notify_for` = 1 limit 1
select * from `admins`
insert into `in_app_notifications` (`description`, `in_app_notificationable_id`, `in_app_notificationable_type`, `updated_at`, `created_at`) values ('{\"name\":\"Alekhyaa Kuna\",\"image\":\"http:\/\/127.0.0.1:8000\/assets\/admin\/img\/default.png\",\"link\":\"http:\/\/127.0.0.1:8000\/admin\/project\/investment\",\"icon\":\"fas fa-ticket-alt text-white\",\"text\":\"FL2029 invest  18,999  INR  form Project My Startup Pack . Total Unit\u00a0 : 1\u00a0 , Per Unit Price\u00a0 :  18,999  INR \"}', 1, 'App\Models\Admin', '2024-09-28 16:41:28', '2024-09-28 16:41:28')
---
    public function adminPushNotification($templateKey, $params = [], $action = [])
    {

        try {
            $basic = basicControl();
            if ($basic->in_app_notification != 1) {
                return false;
            }

            $templateObj = NotificationTemplate::where('template_key', $templateKey)->where('notify_for', 1)->first();
            if (!$templateObj->status['in_app']) {
                return false;
            }

            if ($templateObj) {
                $template = $templateObj->in_app;
                foreach ($params as $code => $value) {
                    $template = str_replace('[[' . $code . ']]', $value, $template);
                }
                $action['text'] = $template;
            }

            $admins = Admin::all();
            foreach ($admins as $admin) {
                $inAppNotification = new InAppNotification();
                $inAppNotification->description = $action;
                $admin->inAppNotification()->save($inAppNotification);

select * from `notification_templates` where `template_key` = 'PROJECT_INVEST' and `notify_for` = 1 limit 1
---
    public function adminMail($templateKey = null, $params = [], $subject = null, $requestMessage = null)
    {
        $basic = basicControl();

        if ($basic->email_notification != 1) {
            return false;
        }

        $email_body = $basic->email_description;
        $templateObj = NotificationTemplate::where('template_key', $templateKey)->where('notify_for', 1)->first();

select * from `admins`
---

        $subject = ($subject == null) ? $templateObj->subject : $subject;
        $email_from = $basic->sender_email;
        $admins = Admin::all();