app/Traits/PaymentValidationCheck.php

    public function validationCheck($amount, $gateway, $currency, $cryptoCurrency = null,$paymentType = null)
    {

        try {
            $gateway = Gateway::where('id', $gateway)->where('status', 1)->first();
---
select * from `gateways` where `id` = '1000' and `status` = 1 limit 1