app/Helpers/helpers.php

select `id`, `firstname`, `lastname`, `username`, `email`, `phone_code`, `phone`, `referral_id`, `total_invest`, `created_at` from `users` where `referral_id` = 1 and `users`.`deleted_at` is null
---
function getDirectReferralUsers($userId)
{
    $directReferralUsers = User::where('referral_id', $userId)->get(['id', 'firstname', 'lastname', 'username', 'email', 'phone_code', 'phone', 'referral_id', 'total_invest', 'created_at']);