app/Http/Controllers/FrontendController.php

select * from `projects` where (`expiry_date` > '2024-09-28 16:40:10' or `project_duration_has_unlimited` = 1) and `status` = 1 and `is_deleted` = 0 order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `projects` where (`expiry_date` > '2024-09-28 16:40:10' or `project_duration_has_unlimited` = 1) and `status` = 1 and `is_deleted` = 0
---
    public function projects()
    {
        $projects = Project::with('details')
            ->where(function ($query) {
                $query->where('expiry_date','>',Carbon::now())
                    ->orWhere('project_duration_has_unlimited' ,1);
            })
            ->where('status', 1)
            ->where('is_deleted', 0)
            ->orderBy('created_at', 'desc')
            ->paginate(15);

select * from `pages` where `slug` = 'project_details' limit 1
select * from `projects` where `projects`.`id` in (1)
---
    public function details($slug)
    {
        $pageSeo = Page::where('slug', 'project_details')->first();
        $pageSeo->meta_keywords =  implode(",", $pageSeo->meta_keywords);
        $pageSeo->image = getFile($pageSeo->meta_image_driver, $pageSeo->meta_image);
        $projectDetails = ProjectDetails::with('project')->where('slug',$slug)->first();