app/Http/Controllers/PaymentController.php

    public function depositConfirm($trx_id)
    {
        try {
            $deposit = Deposit::with('user', 'depositable')->where(['trx_id' => $trx_id, 'status' => 0])->first();
            if (!$deposit) {
                throw new Exception('Invalid Payment Request.');
            }
            $gateway = Gateway::findOrFail($deposit->payment_method_id);
---
select * from `deposits` where (`trx_id` = 'D655647255951' and `status` = 0) limit 1
select * from `users` where `users`.`id` in (3) and `users`.`deleted_at` is null
select * from `gateways` where `gateways`.`id` = 1000 limit 1

    public function fromSubmit(Request $request, $trx_id)
    {
        $data = Deposit::where('trx_id', $trx_id)->orderBy('id', 'DESC')->with(['gateway', 'user'])->first();
---
select * from `deposits` where `trx_id` = 'D655647255951' order by `id` desc limit 1
select * from `gateways` where `gateways`.`id` in (1000)
select * from `users` where `users`.`id` in (3) and `users`.`deleted_at` is null