app/Models/Project.php

    public function getLanguageEditClass($id, $languageId)
    {
        return DB::table('project_details')->where(['project_id' => $id, 'language_id' => $languageId])->exists() ? 'bi-check2' : 'bi-pencil';
---
select exists(select * from `project_details` where (`project_id` = 1 and `language_id` = 1)) as `exists`