app/Models/User.php

    public function getRewardAchievementLevel($id = null)
    {
        $userId = $id ? $id : $this->id;
        $referralData = $this->referralUsersWithInvestment([$userId]);
        $levelConfig = Referral::where('commission_type', 'reward_system')->orderBy('level', 'asc')->get();
---
select * from `referral` where `commission_type` = 'reward_system' order by `level` asc

    public function getUsersWithInvestment($id)
    {
        if (isset($id)) {
            $data['user'] = User::whereIn('referral_id', $id)
                ->where('total_invest', '!=', null)
                ->get(['id', 'firstname', 'lastname', 'username', 'email', 'phone_code', 'phone', 'referral_id', 'created_at']);
---
select `id`, `firstname`, `lastname`, `username`, `email`, `phone_code`, `phone`, `referral_id`, `created_at` from `users` where `referral_id` in (1) and `total_invest` is not null and `users`.`deleted_at` is null

    public function getUsers($id)
    {
        if (isset($id)) {
            $data['user'] = User::whereIn('referral_id', $id)->get(['id', 'firstname', 'lastname', 'username', 'email', 'phone_code', 'phone', 'referral_id', 'created_at']);
---
select `id`, `firstname`, `lastname`, `username`, `email`, `phone_code`, `phone`, `referral_id`, `created_at` from `users` where `referral_id` in (2) and `users`.`deleted_at` is null