app/Http/Controllers/Admin/ProjectController.php

    public function index(): View
    {
        $languages = Language::get();
---
select * from `languages`

    public function list(Request $request)
    {
        $defaultLanguage = Language::where('default_status', 1)->first();
        $languages = Language::get();
---
select * from `languages` where `default_status` = 1 limit 1
select * from `languages`